// ThreadTest.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <Windows.h>
#include <stdio.h>
#include <string>
#include "ThreadPool.h"

typedef DWORD WINAPI Func(LPVOID lpParam);


DWORD WINAPI MyFunc(LPVOID lpParam)
{
    std::string str = std::to_string(GetCurrentThreadId()) + "\n";
    std::cout << str << std::flush;
    return 0;
}

int main()
{
    ThreadPool* threadPool = new ThreadPool(3);
    for (int i = 0; i < 5; i++)
    {
        threadPool->ExecuteTask(MyFunc);
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
